#include <stdio.h>
#include "windows.h"
void main()
{
	SetConsoleOutputCP(1251);
	printf("+---------------------------------+\n");
	printf("|            Таблица  \t\t  |\n");
	printf("+---------------------------------+\n");
	printf("+---------------------------------+\n");
	printf("| Фамилия \t\t|Группа\t  |\n");
	printf("+---------------------------------+\n");
	printf("+---------------------------------+\n");
	printf("| Иванов\t\t|1\t  |\n");
	printf("+---------------------------------+\n");
	printf("+---------------------------------+\n");
	printf("| Петров\t\t|2\t  |\n");
	printf("+---------------------------------+\n");
	printf("+---------------------------------+\n");
	printf("| Сидоров\t\t|3\t  |\n");
	printf("+---------------------------------+\n");
}